[{"id":1,"recommenderName":"Nishma Bhavsar","position":"Business Analyst","companyName":"Neebal Technologies Pvt Ltd","description":"Dharm is a proactive and tireless contributor who would make a great addition to any team. His skills on various technologies makes him stand alone unique from the crowd. I have seen his handful of work implemented in making the software applications. Always enthusiastic in learning something new. I would highly recommend him for any position, as he naturally rises to the occasion when presented with something he is passionate about."},{"id":2,"recommenderName":"Shashidhar Pamarthi","position":"Software Developer","companyName":"Neebal Technologies Pvt. Ltd.","description":"Dharmendra is a very smart individual who has a good grip on the latest Java technologies. The wide variety of projects he has worked on has helped him garner a good amount of knowledge. His determination to complete the project on time and with perfection has helped provide a great customer satisfaction in his stint as a Developer in Neebal Technologies."},{"id":3,"recommenderName":"Hitesh Baid","position":"Software Engineer","companyName":"Neebal Technologies Pvt. Ltd.","description":"I have worked with Dharam for almost over a year and the learnings I got from him is tremendous. He is a very technical guy with good knowledge of business development which is important from development perspective. Database queries is one of his strength. He passion towards learning new technology encourages to go further and try new things."},{"id":4,"recommenderName":"Abishai Dmello","position":"Software Engineer","companyName":"Neebal Technologies Pvt. Ltd.","description":"Having worked with Dharmendra at Neebal technologies for over a year the following is what I observed.\r\n\r\nDharmendra is someone who takes the time to understand the business requirements and process before he starts development. This way he is able to get in a couple of suggestions and ideas whether it be from the Technology stack or inputs to the business process.\r\nHe is one of the few ones who despite the tight timelines will go the extra mile to give an additional feature that helps.\r\nA great mentor for someone looking to learn any technology in the development stack. Have yet to meet someone who can debug and solve an issue as quickly and efficiently as him."}]